app/controllers/expenses_controller.rb

  def index
    @expenses = Expense.all
---
SELECT "expenses".* FROM "expenses"

  def create
    @expense = Expense.new(expense_params)

    respond_to do |format|
      if @expense.save
---
INSERT INTO "expenses" ("amount", "created_at", "date", "type", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["amount", 300.0], ["created_at", "2014-06-02 02:49:28.835868"], ["date", "2014-06-02"], ["type", ""], ["updated_at", "2014-06-02 02:49:28.835868"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @expense.update(expense_params)
---
UPDATE "expenses" SET "type" = ?, "updated_at" = ? WHERE "expenses"."id" = 7  [["type", "Rent"], ["updated_at", "2014-06-06 16:13:04.460517"]]

  def destroy
    @expense.destroy
---
DELETE FROM "expenses" WHERE "expenses"."id" = ?  [["id", 6]]

    def set_expense
      @expense = Expense.find(params[:id])
---
SELECT  "expenses".* FROM "expenses"  WHERE "expenses"."id" = ? LIMIT 1  [["id", 7]]